## PANDAS BASIC

In [1]:
import pandas as pd

In [2]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

# Q.1 Create a pandas series that contains the following data : 4, 8, 15, 16, 23, and 42. Then print the series.

In [3]:
S=[4,8,15,16,23,42]
i=["a","b","c","d","e","f"]

In [4]:
s2=pd.Series(S, index=i)

In [5]:
s2

a     4
b     8
c    15
d    16
e    23
f    42
dtype: int64

In [6]:
type(s2)

pandas.core.series.Series

In [7]:
s1=pd.Series(list(S),index=i)

In [8]:
s1

a     4
b     8
c    15
d    16
e    23
f    42
dtype: int64

In [9]:
type(s1)

pandas.core.series.Series

# Q.2 Create a variable of list type containing 10  elements in it, and apply pandas.series function on the variable print it.

In [10]:
my_list=[5,15,25,35,45,55,65,75,85,95]

In [11]:
my_series=pd.Series(my_list)

In [12]:
my_series

0     5
1    15
2    25
3    35
4    45
5    55
6    65
7    75
8    85
9    95
dtype: int64

# Q.3 Create a pandas DataFrame that contains the following data:
Name= Alice, Bob, Claire, 
Age= 25,30,27,
Gender= Female, Male, Female

Then print the DataFrame

In [13]:
d1={"Name" : ["Alica","Bob","Claire"],"Age" :[25,30,27],"Gender" :["Female","Male","Female"]}

In [14]:
df=pd.DataFrame(d1)

In [15]:
df

     Name  Age  Gender
0   Alica   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [16]:
df.set_index("Name",inplace=True)

In [17]:
df

        Age  Gender
Name
Alica    25  Female
Bob      30    Male
Claire   27  Female

# Q.4 What is "DataFrame" in pandas and how is it different from pandas.series? Explain with an example.

## What is "DataFrame" in pandas and how is it different from pandas.series?

In pandas, a DataFrame is a two-dimensional labeled data structure, similar to a table in a relational database or an Excel spreadsheet. It is one of the primary data structures used for data manipulation and analysis in pandas. A DataFrame is capable of holding data of different data types, and it organizes data in rows and columns, where each column can have a different data type.

On the other hand, a pandas Series is a one-dimensional labeled array, which can be thought of as a single column of data. It is similar to a Python list or a one-column DataFrame. A Series can hold data of the same data type and is associated with an index that labels each element in the Series.

## Explain with an example.

In [18]:
d1

{'Name': ['Alica', 'Bob', 'Claire'],
 'Age': [25, 30, 27],
 'Gender': ['Female', 'Male', 'Female']}

In [19]:
# creating a dataframe from the d1
df2=pd.DataFrame(d1)

In [20]:
df2

     Name  Age  Gender
0   Alica   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [21]:
print(df2)

     Name  Age  Gender
0   Alica   25  Female
1     Bob   30    Male
2  Claire   27  Female

In the above example, data is a dictionary containing three columns: 'Name', 'Age', and 'Gender'. When we pass this data to pd.DataFrame(), it creates a DataFrame with three rows and three columns. Each column has a unique label, and the DataFrame can hold data of different types (strings for 'Name' and 'Gender', and integers for 'Age').

In [22]:
# creating series
Age= pd.Series([25,30,27])

In [23]:

print(Age)

0    25
1    30
2    27
dtype: int64

The Age variable, on the other hand, is a pandas Series that contains three integers. It only has one column of data, and each element in the Series is labeled with an index (0, 1, 2).

In summary, a DataFrame is a two-dimensional data structure that can hold multiple columns of data of different data types, while a Series is a one-dimensional data structure that represents a single column of data with associated labels.

# Q.5 What are the some common functions you can use to manipulate data in a pandas DataFrame? Can you give an example of when you might use one of these functions?

## What are the some common functions you can use to manipulate data in a pandas DataFrame?

In [24]:
###   Some common functions are which can use to manipulate data in a pandas DataFrame
#  1. Filtering: we can filtering rows based conditions using the "loc" or "iloc" function.
df5={"Name" : ["Alica","Bob","Claire"],"Age" :[25,30,27],"Gender" :["Female","Male","Female"]}

In [25]:
df6=pd.DataFrame(df5)

In [26]:
df6

     Name  Age  Gender
0   Alica   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [27]:
#  filter the age greater than 25
filtered_df6= df6.loc[df6["Age"]>25]
print(filtered_df6)

     Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female

In [28]:
# 2.Sorting: we can sort the DataFrame based on one or more columns using the "sort_values" function
sorted_df6=df6.sort_values("Age", ascending=False)
print(sorted_df6)

     Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female
0   Alica   25  Female

In [29]:
sorted_df7=df6.sort_values("Age", ascending=True)
print(sorted_df7)

     Name  Age  Gender
0   Alica   25  Female
2  Claire   27  Female
1     Bob   30    Male

In [30]:
# 3 Grouping and Aggregation: we can group the data on one or more columns and perform aggregate functions on the groups.
group_df=df6.groupby("Gender").agg({"Age":"mean"})
print(group_df)

         Age
Gender
Female  26.0
Male    30.0

In [31]:
# 4.Adding and Dropping columns: we can add new columns or drop existing one column 
df6

     Name  Age  Gender
0   Alica   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [32]:
# add new column
df6["Country"] = ["America","India","england"]

In [33]:
df6

     Name  Age  Gender  Country
0   Alica   25  Female  America
1     Bob   30    Male    India
2  Claire   27  Female  england

In [34]:
df6

     Name  Age  Gender  Country
0   Alica   25  Female  America
1     Bob   30    Male    India
2  Claire   27  Female  england

In [35]:
df5

{'Name': ['Alica', 'Bob', 'Claire'],
 'Age': [25, 30, 27],
 'Gender': ['Female', 'Male', 'Female']}

In [36]:
df6

     Name  Age  Gender  Country
0   Alica   25  Female  America
1     Bob   30    Male    India
2  Claire   27  Female  england

In [37]:
# Drop the country column
df8= df6.drop("Country", axis=1,inplace=True)

In [38]:
df8

In [39]:
df6

     Name  Age  Gender
0   Alica   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [40]:
df8

In [41]:
# 5 Concat: we can merge or join multiple DataFrames based on a common column using fuction like Concat()
df55={ "City":["london","Delhi","Kolkata"],"Country":["UK","India","WB"]}
df555=pd.DataFrame(df55)

In [42]:
df555

      City Country
0   london      UK
1    Delhi   India
2  Kolkata      WB

In [43]:
df6

     Name  Age  Gender
0   Alica   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [44]:
df9=pd.concat([df555,df6], axis=1)

In [45]:
df9

      City Country    Name  Age  Gender
0   london      UK   Alica   25  Female
1    Delhi   India     Bob   30    Male
2  Kolkata      WB  Claire   27  Female

## Can you give an example of when you might use one of these functions?

In [46]:
## previous answer

# Q.6 Which of the following is mutable in nature series, DataFrame,Panel?

  Ans: The only mutable data structure in pandas in the DataFrame.
A: Series: 
         A pandas Series is one-dimensional and behaves like an array or a list. It is immutable, meaning once it is created, you cannot modify its elements. You can, however, create a             new Series with modified values based on the original Series.

B:   DataFrame: 
              A pandas DataFrame is two-dimensional and resembles a table with rows and columns. It is mutable, which means you can modify its contents after creation. You can change                    values in specific cells, add or delete rows or columns, and perform various other data manipulations.

C:  Panel: 
       In older versions of pandas, there was a data structure called "Panel" that could hold data in three dimensions. However, as of pandas version 0.25.0, the Panel has been                   deprecated, and developers are encouraged to use MultiIndex DataFrames instead. Therefore, the Panel is not a part of the latest pandas versions and is not relevant for 
       this question.

  To summarize, only the DataFrame is mutable in pandas, while Series is immutable.

# Q.7 Create a DataFrame using multiples series. Explain with an example.

## Create a DataFrame using multiples series.

In [47]:
# Creating a DataFrame using multiple Series is a common operation in pandas. I can think of a Series as a single column, and by combining multiple Series together,
#        I can create a DataFrame with multiple columns.

#         Let's create a simple example where we have three Series representing the names, ages, city,Gender and Country of five  individuals. We'll combine these Series into a
#         DataFrame to represent a small dataset of people:

In [48]:
name_series=pd.Series(["Alica","Bob","Claire"])
ages_series=pd.Series([25,30,2])
gender_series=pd.Series(["Female","Male","Female"])
country_series=pd.Series(["UK","India","WB"])
city_series=pd.Series(["london","Delhi","Kolkata"])

In [49]:
data_series={"Name": name_series,"Ages": ages_series,"Gender": gender_series,"Country": country_series, "City": city_series}

In [50]:
df777=pd.DataFrame(data_series)

In [51]:
df777

     Name  Ages  Gender Country     City
0   Alica    25  Female      UK   london
1     Bob    30    Male   India    Delhi
2  Claire     2  Female      WB  Kolkata

## Explain with an example.

In the above example, I first create five separate Series: names_series, ages_series,city_series, country_series and gender_series. Each Series represents the names, ages,city,country, andgender of  five individuals, respectively.

Next, we create a dictionary called data_series where each key-value pair represents a column name and the corresponding Series containing the data for that column.

Finally, we use the pd.DataFrame() constructor to create a DataFrame called df by passing the data dictionary as an argument.

The resulting DataFrame contains five columns: 'Name', 'Age','City', Country, and Gender , with each row representing information about a specific individual.